Tekla.Structures.Drawing.SinglePartDrawing
The SinglePartDrawing class is for handling single part drawings.

Tekla.Structures.Drawing.SinglePartDrawing.PartIdentifier
The identifier of the model object part.

Tekla.Structures.Drawing.SinglePartDrawing.SheetNumber
The sheet number of the drawing.

Tekla.Structures.Drawing.SinglePartDrawing.#ctor(Tekla.Structures.Identifier)
Instantiates a new single part drawing with standard attributes.
partIdentifier: The identifier of the model object part

Tekla.Structures.Drawing.SinglePartDrawing.#ctor(Tekla.Structures.Identifier,System.String)
Instantiates a new single part drawing with given attributes.
partIdentifier: The identifier of the model object part
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.SinglePartDrawing.#ctor(Tekla.Structures.Identifier,System.Int32)
Instantiates a new single part drawing with standard attributes and with a specified sheet number.
partIdentifier: The identifier of the model object part
sheetNumber: The sheet number of the drawing.

Tekla.Structures.Drawing.SinglePartDrawing.#ctor(Tekla.Structures.Identifier,System.Int32,System.String)
Instantiates a new single part drawing with standard attributes and with a specified sheet number.
partIdentifier: The identifier of the model object part
sheetNumber: The sheet number of the drawing.
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.SinglePartDrawing.Modify
Updates the drawing object in the database.
Returns: True on success.

Tekla.Structures.Drawing.SinglePartDrawing.Insert
Inserts a new single part drawing. Views are added according to the View Creation rules of the standard file.
A drawing can be inserted only when there is no active drawing.
Returns: True on success.
Throws Tekla.Structures.Drawing.CannotInsertDrawingException: Thrown if inserting a drawing when another drawing is active.

Tekla.Structures.Drawing.SinglePartDrawing.Select
Selects the drawing.
Returns: True on success.